TMaxElectronics/Pic32Uart/UART.c
/*
        UART Driver for pic32
        Copyright Sep. 2018 TMAX-Electronics.de
 */

#include <stdio.h>
#include <xc.h>
#include <string.h>
#include <stdarg.h>
#include <sys/attribs.h>
#include <sys/kmem.h>

#include "UART.h"
#include "UARTconfig.h"
#include "FreeRTOSConfig.h"
#include "FreeRTOS.h"
#include "task.h"
#include "stream_buffer.h"
#include "semphr.h"
#include "TTerm.h"
#include "DMAutils.h"
#include "System.h"
#include "printf.h"
#include "Timer.h"

#define UART_getIRQsEnabledInternal(handle) handle->internalIrqs

typedef struct{
    UartISR_t function;
    UartHandle_t * handle;
    uint32_t enabledEventFlags;
    void * data;
} UartISRDescriptor_t;

static UartISRDescriptor_t isrDescriptors[UART_NUM_MODULES] = {[0 ... (UART_NUM_MODULES - 1)] = {.function = NULL, .handle = NULL}};


static uint32_t UART_getIRQsEnabledInternalRaw(uint32_t moduleNumber);
static void UART_setIRQsEnabledInternalRaw(uint32_t moduleNumber, uint32_t eventIrqsEnabled);
static uint32_t UART_setIRQsEnabledInternal(UartHandle_t * handle, uint32_t eventIrqsEnabled);
static void UART_printfOutputFunction(char character, void* arg);
static uint32_t UART_txDmaISR(uint32_t evt, void * data);

//initializes a UART module and returns a handle for it
//NOT: module will stay disabled until UART_setModuleOn(handle, 1); is called
UartHandle_t * UART_init(uint32_t module, uint32_t baudRate){
    //try to get memory for the handle
    UartHandle_t * ret = UART_MALLOC(sizeof(UartHandle_t));
    
    //did we get memory?
    if(ret == NULL){
        return NULL;
    }
    
    //assign register map
    ret->descriptor = &Uart_moduleMap[module - 1];
    ret->number = module;
    
    //zero out all registers
    UART_getRegs(ret)->BRG = 0;
    UART_getRegs(ret)->UMODE.w = 0;
    UART_getRegs(ret)->USTA.w = 0;
    ret->txCallback = NULL;
    
    //baud rate 
    UART_setBaud(ret, baudRate);
    
    //generate an event stream
    ret->eventStream = xStreamBufferCreate(UART_EVENTBUFFER_SIZE,0);
    
    //generate semaphores for tx and reset the flags
    ret->txSemaphore = xSemaphoreCreateBinary();
    xSemaphoreGive(ret->txSemaphore);
    ret->txDmaSemaphore = xSemaphoreCreateBinary();
    xSemaphoreGive(ret->txDmaSemaphore);
    ret->txISRFlags = 0;
    
    //rx and tx dma is disabled by default, clear the pointers
    ret->rxDMAHandle = NULL;
    
    ret->txDMAHandle = NULL;
    ret->txBuffer;
    ret->txBufferPosition = 0;
    
    //set the handle in the isr descriptor
    isrDescriptors[module-1].handle = ret;
    
    //enable the module (not rx or tx, just the module itself)
    UART_setEnabled(ret, 1);
    
    return ret;
}

void UART_updateBaudForSleep(UartHandle_t * handle, uint32_t sleep){
    if(sleep){
        UART_REGS->UMODE.BRGH = 1;
        UART_REGS->BRG = (configSECONDARY_CLOCK_HZ / (4 * handle->currentBaudrate)) - 1;
    }else{
        UART_setBaud(handle, handle->currentBaudrate);
    }
}

void UART_setTxCallback(UartHandle_t * handle, UartTxCallback_t callback){
    handle->txCallback = callback;
}


//TODO make this function make sense... we want the maximum time resolution possible to just a fixed threshold of 250kbaud
void UART_setBaud(UartHandle_t * handle, uint64_t newBaud){
    handle->currentBaudrate = newBaud;
    if(newBaud > 250000){
        UART_REGS->UMODE.BRGH = 1;
        UART_REGS->BRG = (UART_CLK_Hz / (4 * newBaud)) - 1;
    }else{
        UART_REGS->UMODE.BRGH = 0;
        UART_REGS->BRG = (UART_CLK_Hz / (16 * newBaud)) - 1;
    }
}

uint32_t UART_getBaud(UartHandle_t * handle){
    return (UART_CLK_Hz/ (((UART_REGS->UMODE.BRGH) ? 4 : 16) * (UART_REGS->BRG+1)));
}


//sends a string directly to the output buffer, incase there is some dramatic error
//we don't use the semaphore here as this will only be called from a context where an error prevents the semaphore from being released (tx error, _general_exception_handler, vAssert, etc.)
void UART_sendString(UartHandle_t * handle, char *data){
    UART_txCallback(handle, UART_TX_STARTED);
    
    while((*data) != 0){
        while(UART_isTxBufferFull(handle));
        UART_REGS->TXREG = *data++;
    }
            
    UART_txCallback(handle, UART_TX_FINISHED);
}

//enable or disable the internal rx and tx routines
//WARNING: when disabling the rx dma the user must ensure that no task is currently trying to read from the dma buffer as it will be freed!
uint32_t UART_setInternalRWEnabled(UartHandle_t * handle, uint32_t rxEnabled, uint32_t txEnabled){
    
    //should we change something about the rx routines?
    if(rxEnabled != UART_RW_LEAVE_UNCHANGED){
        //are we switching the rx routines on?
        if(rxEnabled){
            //yes, check if it is already on. if so we can return as there's nothing to do
            if(handle->rxDMAHandle != NULL) return pdPASS;

            //rx is not enabled but user wants it to be. Allocate a new dma ringbuffer
            DMA_RingBufferHandle_t * newBuffer = DMA_createRingBuffer(UART_BUFFERSIZE, 1, UART_getRXRegPtr(handle), Uart_getRxIRQNum(handle), 1, RINGBUFFER_DIRECTION_RX);

            //we used to set the abort irq to the fault interrupt, but don't do this anymore as in case of a fault occuring all data is flushed from the buffer and lost
            //a uart error would cause our own interrupt handler to be invoked, where we could deal with the issue ourselves
            //DMA_RB_setAbortIRQ(handle->rxDMAHandle, handle->fltVector, 1);

            //enable the dma channel
            DMA_setEnabled(newBuffer->channelHandle, 1);
            
            //set up the rx interrupt to occur as long as there is data in the buffer
            UART_setRxIrqMode(handle, UART_RX_IRQ_WHEN_DATA_AVAILABLE);
            
            //enable internal irqs
            UART_setIRQsEnabledInternal(handle, UART_EVENTFLAG_ERROR_IRQ);
            
            //assign the buffer
            handle->rxDMAHandle = newBuffer;
        }else{
            //no, free the currently present ringbuffer

            if(handle->rxDMAHandle == NULL) return pdPASS; //already free'd

            //free the buffer
            DMA_freeRingBuffer(handle->rxDMAHandle);
            handle->rxDMAHandle = NULL;
        }
    }
    
    //should we change something about the tx routines?
    if(txEnabled != UART_RW_LEAVE_UNCHANGED){
        //are we switching the rx routines on?
        if(txEnabled){
            //yes, check if it is already on. if so we can return as there's nothing to do
            if(handle->txDMAHandle != NULL) return pdPASS;
            
            //generate a tx buffer for printing
            handle->txBuffer = UART_MALLOC(UART_BUFFERSIZE);
            
            //tx is currently off and needs to be enabled. Allocate a dma channel
            DmaHandle_t * newChannel = DMA_allocateChannel();
            
