TMaxElectronics/Pic32Uart/UART.c
            //set constant transfer attributes (src will be set once a transfer is initiated)
            DMA_setDestConfig(newChannel, UART_getTXRegPtr(handle), 1);
            DMA_setChannelAttributes(newChannel, 0, 0, 0, 0, 2);
            
            //set up interrupts
            DMA_setIRQHandler(newChannel, UART_txDmaISR, handle);
            DMA_setInterruptConfig(newChannel, 0, 0, 0, 0, 1, 0, 1, 1); //block complete, abort and error irqs enabled
            
            //and finally set up the tx interrupt to occur as long as there is space in the tx buffer
            UART_setTxIrqMode(handle, UART_TX_IRQ_WHEN_SPACE_AVAILABLE);
            
            //finally assign the channel
            handle->txDMAHandle = newChannel;
        }else{
            //no, free the currently present ringbuffer
            
            if(handle->txDMAHandle == NULL) return pdPASS; //already free'd
            
            //make sure no transmission is currently going on
            if(!xSemaphoreTake(handle->txSemaphore, portMAX_DELAY)){
                //what somehow this didn't work... we need to return
                return pdFAIL;
            }
            
            //no transmission going on, its safe to free the dma
            DMA_freeChannel(handle->txDMAHandle);
            handle->txDMAHandle = NULL;
            
            UART_FREE(handle->txBuffer);
            handle->txBuffer = NULL;
            
            //return the semaphore
            xSemaphoreGive(handle->txSemaphore);
        }
    }
}
 
void UART_isrHandler(uint32_t moduleNumber, uint32_t ifsState){
    //a uart irq just occurred, check what we need to do to handle it
    
    UartISRDescriptor_t * isr = &isrDescriptors[moduleNumber-1];
    
    //is there a handle defined for the module?
    if(isr->handle == NULL){
        //no, switch off the timer and return
        UART_setIRQsEnabledInternalRaw(moduleNumber-1, 0);
        
        return;
    }
    
    //first get the handle
    UartHandle_t * handle = isr->handle;
    
    //check what interrupt occured 
    
    uint8_t evtFlags = 0;
    
    if(ifsState & handle->descriptor->errorMask){
        //error interrupt. get the error type(s) and push a notification into the handle's event queue
        
        evtFlags |= UART_EVENTFLAG_ERROR_IRQ;
        UART_clearErrorIF(handle);
        
        //figure out what errors occurred and deal with them
        
        if(UART_REGS->USTA.FERR){ //framing error, clear error byte from the buffer
            evtFlags |= UART_EVENTFLAG_ERROR_FRAMING;
        }
        
        if(UART_REGS->USTA.PERR){ //parity error, clear error byte from the buffer
            evtFlags |= UART_EVENTFLAG_ERROR_PARITY;
        }
        
        if(UART_REGS->USTA.OERR){ //overflow error, this will need to be reset loosing the data currently in the buffer
            evtFlags |= UART_EVENTFLAG_ERROR_OVERFLOW;
            
            //clear the error
            UART_clearOERR(handle);
        }
        
        //then we send any events to the eventStream. We do this now as rx and tx events don't need to go there TODO: evaluate if we might not need them after all
        xStreamBufferSendFromISR(handle->eventStream, &evtFlags, 1, NULL);
    }
    
    if(ifsState & handle->descriptor->txMask){
        //tx interrupt
        evtFlags |= UART_EVENTFLAG_TX_IRQ;
        UART_clearTxIF(handle);
        
        //check if we were doing a transmission from our internal dma and the transfer has finished
        if(handle->txISRFlags & UART_TXFLAG_WAITING_FOR_END){
            //yes we need to finish the last transfer
            handle->txISRFlags &= ~UART_TXFLAG_WAITING_FOR_END;
            
            //return the dma semaphore TODO add higherprioritytaskswoken again
            xSemaphoreGiveFromISR(handle->txDmaSemaphore, NULL);

            //then check if we also need to return the normal txSemaphore
            if(handle->txISRFlags & UART_TXFLAG_NON_BLOCKING_TRANSFER){
                //last transmission was a non-blocking one so we need to do the cleanup

                //and finally return the txSemaphore
                xSemaphoreGiveFromISR(handle->txSemaphore, NULL);
            }
            
            UART_txCallback(handle, UART_TX_FINISHED);
            
            //disable our irq again
            UART_setIRQsEnabledInternal(handle, UART_getIRQsEnabledInternal(handle) & ~UART_EVENTFLAG_TX_IRQ);
        }
    }
    
    if(ifsState & handle->descriptor->rxMask){
        //rx interrupt
        evtFlags |= UART_EVENTFLAG_RX_IRQ;
        UART_clearRxIF(handle);
    }
    
    //make sure that we only deliver events that the function wants to receive
    evtFlags &= isr->enabledEventFlags;
    
    //now check if an isr is assigned to this module and we have an event for it
    if(isr->function != NULL && evtFlags){
        //yep we have an isr and and event to dispatch to it
        (*isr->function)(handle, evtFlags, isr->data);
    }
}

//interrupt related functions


//assign an interrupt routine to a module. To de-assign call with isr* = NULL
uint32_t UART_setISR(UartHandle_t * handle, UartISR_t isr, void * data){
    //are we assigning or de-assigning?
    if(isr == NULL){
        //write NULL into the isr list for the function and we're done
        isrDescriptors[handle->number-1].function = NULL;
    }else{
        //is there already a function assigned? If so we won't overwrite it
        if(isrDescriptors[handle->number-1].function != NULL) return pdFAIL;
        
        //assign the function and data
        isrDescriptors[handle->number-1].function = isr;
        isrDescriptors[handle->number-1].data = data;
    }
    
    return pdPASS;
}

void UART_setInterruptPriority(UartHandle_t * handle, uint32_t priority, uint32_t subPriority){
    //we will have to perform a read-modify-write on the register to update the priority
    //since this would take forever though we utilise the pics SET and CLR registers together with a mask
    
    //first we need to select the correct descriptor. If the timer is in 32bit mode all interrupt related settings come from the slave timer
    UartDescriptor_t * desc = handle->descriptor;
    
