TMaxElectronics/Pic32Uart/UART.c
    //first we make sure the interrupt is off
    uint32_t irqsEnabled = UART_getIRQsEnabledInternalRaw(handle->number);
    UART_setIRQsEnabledInternalRaw(handle->number, 0);
    
    //then we clear the priority bits. There are 5 (hence 0b11111) and located at the offset pointed to by ipcOffset
    desc->ipcReg->CLR = 0b11111 << desc->ipcOffset;
    
    //then we generate the new priority bits
    Pic32PrioBits_t map = {.priority = priority, .subPriority = subPriority};
    
    //after that we assign the shifted mask to the SET register to complete the operation
    desc->ipcReg->SET = map.map << desc->ipcOffset;
   
    UART_setIRQsEnabledInternalRaw(handle->number, irqsEnabled);
}

//function to get what iec bits are set
static uint32_t UART_getIRQsEnabledInternalRaw(uint32_t moduleNumber){
    uint32_t ret = 0;
    
    if(Uart_moduleMap[moduleNumber - 1].iecReg->w & Uart_moduleMap[moduleNumber - 1].rxMask) ret |= UART_EVENTFLAG_RX_IRQ;
    if(Uart_moduleMap[moduleNumber - 1].iecReg->w & Uart_moduleMap[moduleNumber - 1].txMask) ret |= UART_EVENTFLAG_TX_IRQ;
    if(Uart_moduleMap[moduleNumber - 1].iecReg->w & Uart_moduleMap[moduleNumber - 1].errorMask) ret |= UART_EVENTFLAG_ERROR_IRQ;
    
    return ret;
}

//internal function that can also set error irq
static void UART_setIRQsEnabledInternalRaw(uint32_t moduleNumber, uint32_t eventIrqsEnabled){
    //write the required bits into the iec register
    if(eventIrqsEnabled & UART_EVENTFLAG_RX_IRQ) Uart_moduleMap[moduleNumber - 1].iecReg->SET = Uart_moduleMap[moduleNumber - 1].rxMask; else Uart_moduleMap[moduleNumber - 1].iecReg->CLR = Uart_moduleMap[moduleNumber - 1].rxMask;
    if(eventIrqsEnabled & UART_EVENTFLAG_TX_IRQ) Uart_moduleMap[moduleNumber - 1].iecReg->SET = Uart_moduleMap[moduleNumber - 1].txMask; else Uart_moduleMap[moduleNumber - 1].iecReg->CLR = Uart_moduleMap[moduleNumber - 1].txMask;
    if(eventIrqsEnabled & UART_EVENTFLAG_ERROR_IRQ) Uart_moduleMap[moduleNumber - 1].iecReg->SET = Uart_moduleMap[moduleNumber - 1].errorMask; else Uart_moduleMap[moduleNumber - 1].iecReg->CLR = Uart_moduleMap[moduleNumber - 1].errorMask;
}

static uint32_t UART_setIRQsEnabledInternal(UartHandle_t * handle, uint32_t eventIrqsEnabled){
    handle->internalIrqs = eventIrqsEnabled;
    
    //update the enable bits
    UART_setIRQsEnabledInternalRaw(handle->number, handle->internalIrqs | handle->externalIrqs);
}

//external function, this only returns what events will cause the set isr to be called
uint32_t UART_getIRQsEnabled(UartHandle_t * handle){
    return handle->externalIrqs;
}

//sets which interrupts are enabled. The error interrupt is always on and will always call the libraries internal isr
void UART_setIRQsEnabled(UartHandle_t * handle, uint32_t eventIrqsEnabled){
    //assign this to the handle
    handle->externalIrqs = eventIrqsEnabled;
    
    //update the enable bits
    UART_setIRQsEnabledInternalRaw(handle->number, handle->internalIrqs | handle->externalIrqs);
    
    //then update the enabled events in the isr descriptor
    isrDescriptors[handle->number-1].enabledEventFlags = eventIrqsEnabled;
}

//function that handles the DMA interrupt when transmitting data
static uint32_t UART_txDmaISR(uint32_t evt, void * data){
    
    //freeRtos magic :3
    BaseType_t wake1 = pdFALSE;
    BaseType_t wake2 = pdFALSE;

    //tx DMA interrupt just occured
    
    //first get our handle
    UartHandle_t * handle = (UartHandle_t *) data;
    
    //we don't need to check which event occured, as all would be treated almost identically anyway
    
    //check if we need to wait until the last bit was transmitted (which is the case if a txCallback is assigned)
    if(handle->txCallback != NULL){
        //yes, instead of returning right away we need to continue to the tx interrupt
        
        //set it up
        UART_setTxIrqMode(handle, UART_TX_IRQ_WHEN_FINAL_BYTE_SENT);
        UART_clearTxIF(handle);
        handle->txISRFlags |= UART_TXFLAG_WAITING_FOR_END;
        
        //enable it
        UART_setIRQsEnabledInternal(handle, UART_getIRQsEnabledInternal(handle) | UART_EVENTFLAG_TX_IRQ);
    }else{
        //no, we can return to the code right away
        
        //return the dma semaphore
        xSemaphoreGiveFromISR(handle->txDmaSemaphore, &wake1);
        
        //then check if we also need to return the normal txSemaphore
        if(handle->txISRFlags & UART_TXFLAG_NON_BLOCKING_TRANSFER){
            //last transmission was a non-blocking one so we need to do the cleanup

            //and finally return the txSemaphore
            xSemaphoreGiveFromISR(handle->txSemaphore, &wake2);
        }
    }

    //clean up dma
    DMA_setIRQEnabled(handle->txDMAHandle, 0);
    if(evt & DMA_EVTFLAG_ADDRERR) DMA_abortTransfer(handle->txDMAHandle); //if some address error was detected we want to abort the transfer. Any other event thats enabled already does this by itself

    //TODO: the way this is implemented right now the user won't be able to know if something went wrong with the transmission after dma was started unless a timeout occurs instead of a dma error (which is pretty unlikely)
    
    portEND_SWITCHING_ISR(wake1 || wake2);
}

//this function sends bytes from a buffer out on the uart line
//IMPORTANT: if you use this function in non-blocking mode you must make sure that the buffer does not get accessed or (even worse) freed immediately after this function returns as it is still busy sending bytes
uint32_t UART_sendBuffer(UartHandle_t * handle, char * buffer, uint32_t size, uint32_t waitTimeout, uint32_t txFlags){
    //is there anything to send and tx even enabled? If not we can just return as we can't do anything anyway
    if(!(UART_isTxEnabled(handle) && UART_isTxDMAEnabled(handle))) return 0;
    
    //next we need to get the TX semaphore if the transfer was triggered from outside the library. If this times out we also just return without transmitting anything
    //We will also only return it in the following code if the function call was made from outside of the library
    if(!(txFlags & UART_TXFLAG_INTERNAL_CALL) &&  !xSemaphoreTake(handle->txSemaphore, waitTimeout)) return 0; //TODO evaluate if the second condition is actually not run!
    
    //WARNING TO ME: from this point on any return from this function must ensure that the txSemaphore gets returned!
    
    //we also have to take the txDmaSemaphore, which is used to signal completion of a transmission
    if(!xSemaphoreTake(handle->txDmaSemaphore, waitTimeout)){ 
        //This is a state that should never be reached! The only time that the txSemaphore is returned is when a transmission has completed, at which point the txDmaSemaphore MUST also be returned
        configASSERT(0);
        
