TMaxElectronics/Pic32Uart/UART.c
        //return the txSemaphore and go have a cry :(
        if(!(txFlags & UART_TXFLAG_INTERNAL_CALL)) if(!(txFlags & UART_TXFLAG_INTERNAL_CALL)) xSemaphoreGive(handle->txSemaphore);
        return 0;
    }
    
    //set the uart tx interrupt
    UART_setTxIrqMode(handle, UART_TX_IRQ_WHEN_SPACE_AVAILABLE);
    
    //tell the dma interrupt any flags that might be set. We can safely write this here as the interrupt is still disabled
    handle->txISRFlags = txFlags;
    
    //is software txEn control enabled? If so we now set the txEn pin
    UART_txCallback(handle, UART_TX_STARTED);
    
    //now we set up the txDMA
    DMA_setSrcConfig(handle->txDMAHandle, buffer, size);    //transmit all bytes out of our buffer
    DMA_setTransferAttributes(handle->txDMAHandle, 1, Uart_getTxIRQNum(handle), DMA_IRQ_DISABLED);    //transfer one byte on every assertion of our uart interrupt
    
    DMA_clearGloablIF(handle->txDMAHandle);     //reset the interrupt flag just incase even if it isn't persistent
    DMA_setIRQEnabled(handle->txDMAHandle, 1);  //enable interrupts
    
    DMA_setEnabled(handle->txDMAHandle, 1);     //ready the dma for a transfer
    
    //start the transfer. Further bit transmission will be triggered automatically by the tx interrupt
    DMA_forceTransfer(handle->txDMAHandle);
    
    //are we supposed to block until the transfer has finished?
    if(txFlags & UART_TXFLAG_NON_BLOCKING_TRANSFER){
        //no, just return
        //NOTE: at this point pretty much no bytes have been transferred yet as we just started the DMA.
        //      we do return as if we had sent all bytes though anyway, as they are queued for transmission and will be transmitted no matter what happens
        //      (except for a reset i guess but that would cause entirely different problems anyway lol :P)
        //
        //      We also don't return the txSemaphore as the transmission is still going on. If another task is waiting to take it it would mess up this transmission if we do
        //
        //      txEnable will also be cleared by the DMA isr
        return size;
    }
    
    //yep we should block. Just wait until the semaphore is returned
    if(!xSemaphoreTake(handle->txDmaSemaphore, UART_TIMEOUT_TX)){
        //whatever we do we want to clear the txEn asap! If txEn is used we have probably already blocked for a while at this point.
        UART_txCallback(handle, UART_TX_FINISHED);
        
        //This state should also never be reachable! If it is reached make sure your timeout is sufficient for the longest transmission that will happen
        //We should never get here as the txDmaSemaphore is returned in the dma complete or dma error interrupt, which MUST occur after the transmission completes or fails
        configASSERT(0);
        
        //TODO: maybe check what happened to the DMA module before aborting the transfer?
        uint32_t bytesWrittenToTxBuffer = DMA_getSourcePointerValue(handle->txDMAHandle);
        
        //clean up the dma to make sure it won't accidentally start transmitting anything
        DMA_setIRQEnabled(handle->txDMAHandle, 0);  //disable interrupts, as the abort will cause a abort interrupt to be triggered
        DMA_abortTransfer(handle->txDMAHandle); //abort transfer and clear the enable bit
        
        //return the txDmaSemaphore to release the dma for another transfer
        xSemaphoreGive(handle->txDmaSemaphore);
        
        //and also return the txSemaphore
        if(!(txFlags & UART_TXFLAG_INTERNAL_CALL)) xSemaphoreGive(handle->txSemaphore);
        
        //finally we return the number of bytes written to the buffer
        //NOTE: this isn't necessarily the number of bytes transmitted. If there are still bytes in the UART buffer when we get here they would count as transmitted even though they were not (yet)
        return bytesWrittenToTxBuffer;
    }
    
    //txDma interrupt triggered :D Now check if the transfer was successful
    //TODO: add flag that states whether a transfer was successful or not
    
    //NOTE: the tx callback is triggered from the uart tx interrupt
    
    //all done, return both semaphores :)
    xSemaphoreGive(handle->txDmaSemaphore);
    if(!(txFlags & UART_TXFLAG_INTERNAL_CALL)) xSemaphoreGive(handle->txSemaphore);
    
    return size;
}

void UART_transmitBreak(UartHandle_t * handle){
    //is tx enabled?
    if(!UART_isTxEnabled(handle)) return;
    
    //get the tx semaphore
    if(!xSemaphoreTake(handle->txSemaphore, UART_DEFAULT_SEND_TIMEOUT)){ 
        return;
    }
    
    UART_txCallback(handle, UART_TX_STARTED);
    
    //transmit the break
    UART_REGS->USTA.UTXBRK = 1;
    UART_REGS->TXREG = 0;
    
    while(UART_REGS->USTA.UTXBRK);
    
    UART_txCallback(handle, UART_TX_FINISHED);
    
    //return the semaphore
    xSemaphoreGive(handle->txSemaphore);
}


//function to write a byte to the buffer
static void UART_printfOutputFunction(char character, void* arg){
    //get the handle
    UartHandle_t * handle = (UartHandle_t *) arg;
    
    //write the data to the buffer
    handle->txBuffer[handle->txBufferPosition++] = character;
    
    //did we fill it up? TODO check this when entering to allow for transmission of a full buffer from here only if another character comes after the current one
    if(handle->txBufferPosition == UART_BUFFERSIZE){
        //yes! We need to transmit the data now
        UART_sendBuffer(handle, handle->txBuffer, handle->txBufferPosition, UART_DEFAULT_SEND_TIMEOUT, UART_TXFLAG_INTERNAL_CALL);
        
        //reset the buffer pointer (data does not need to be cleared as only the number of bytes written to will be sent)
        handle->txBufferPosition = 0;
    }
}

//function to write a byte to the buffer
static void UART_immediatePrintfOutputFunction(char character, void* arg){
    //get the handle
    UartHandle_t * handle = (UartHandle_t *) arg;
    
    //wait for a space in the buffer
    while(UART_isTxBufferFull(handle));
    
