TMaxElectronics/Pic32Uart/UART.c
    //write byte into the buffer and return
    UART_REGS->TXREG = character;
}

uint32_t UART_vfctprintfInternal(UartHandle_t * handle, void (*out)(char c, void* extra_arg), void* extra_arg, const char* format, va_list arg){
    //first set up the txen
    
    //set up interrupt config and clear flag
    uint32_t intConf = UART_getTxIrqMode(handle);
    UART_setTxIrqMode(handle, UART_TX_IRQ_WHEN_FINAL_BYTE_SENT);
        
    //set the tx enable
    UART_txCallback(handle, UART_TX_STARTED);
    
    //transmit data
    uint32_t length = vfctprintf(UART_immediatePrintfOutputFunction, (void*) handle, format, arg);
    handle->descriptor->ifsReg->CLR = handle->descriptor->txMask;
    
    //wait until final byte is sent
    while(!(handle->descriptor->ifsReg->w & handle->descriptor->txMask));
    UART_txCallback(handle, UART_TX_FINISHED);
    
    //restore interrupt config
    UART_setTxIrqMode(handle, intConf);
    return length;
}



//printf function for the UART modules
uint32_t UART_printf(UartHandle_t * handle, char * format, ...){
    //start the va list
    va_list arg;
    va_start (arg, format);
    
    //is tx even enabled?
    if(!(UART_isTxEnabled(handle) && UART_isTxDMAEnabled(handle))){ 
        //end the vaList again
        va_end(arg);
        
        return 0;
    }
    
    //check if the scheduler is running. If not we need to fall back to the scheduler independent printf
    if(xTaskGetSchedulerState() != taskSCHEDULER_RUNNING){
        uint32_t length = UART_vfctprintfInternal(handle, UART_immediatePrintfOutputFunction, (void*) handle, format, arg);
        
        //end the vaList again
        va_end(arg);
        
        return length;
    }
    
    //are we in a critical section? If so we won't transmit anything as a non blocking transmit relies on interrups
    //which are disabled in taskENTER_CRITICAL() and a blocking transmit in a critical section would impact system
    //real-time-nes due to the time it would take to transmit. If you want to do this anyway then use the printfImmediate
    //function
    if(xTaskIsInCriticalSection()){
        //notify user in debug mode
        configASSERT(0);
        
        //end the vaList again
        va_end(arg);
        
        return 0;
    }
    
    //try to get the semaphore
    if(!xSemaphoreTake(handle->txSemaphore, UART_DEFAULT_SEND_TIMEOUT)) return 0;
    
    //reset the buffer
    handle->txBufferPosition = 0;
    
    //fill the buffer with the data to send. If a buffer overflow happens as we do this the contents of the buffer will be automatically sent out and the buffer reset
    uint32_t length = vfctprintf(UART_printfOutputFunction, (void*) handle, format, arg);
    
    //finally check if there is any data left in the buffer that needs to be sent out
    if(handle->txBufferPosition != 0){ 
        //yes. We can do this non-blocking and have the dma isr handle the semaphore returning
        UART_sendBuffer(handle, handle->txBuffer, handle->txBufferPosition, UART_DEFAULT_SEND_TIMEOUT, UART_TXFLAG_INTERNAL_CALL | UART_TXFLAG_NON_BLOCKING_TRANSFER);
    }else{
        //no, we can just return the semaphore right away
        xSemaphoreGive(handle->txSemaphore);
    }
    
    //end the vaList again
    va_end(arg);
    
    return length;
}

//printf function for the UART modules that ignores any freertos functions and just transmits out the byte right away. (Safe to use even when the rtos died)
uint32_t UART_printfImmediate(UartHandle_t * handle, char * format, ...){
    //start the va list
    va_list arg;
    va_start (arg, format);
    
    //is tx even enabled?
    if(!UART_isTxEnabled(handle)){ 
        //end the vaList again
        va_end(arg);
        
        return 0;
    }
    
    //fill the buffer with the data to send. If a buffer overflow happens as we do this the contents of the buffer will be automatically sent out and the buffer reset
    uint32_t length = UART_vfctprintfInternal(handle, UART_immediatePrintfOutputFunction, (void*) handle, format, arg);

    //end the vaList again
    va_end(arg);
    
    return length;
}

//read data out of the dma buffer into a user specified buffer
//NOTE: this function behaves slightly differently from for example a freeRtos streambuffer read. It will wait until some data is available and read it, but not wait until {size} bytes have been read
uint32_t UART_read(UartHandle_t * handle, char * buffer, uint32_t size, uint32_t timeout){
    //wait for any data to be available. If some already is it will continue right away
    if(DMA_RB_waitForData(handle->rxDMAHandle, timeout)){
        //cool, some data was received, now write it to the buffer
        return DMA_RB_read(handle->rxDMAHandle, buffer, size);
    }else{
        //timeout occured :(
        return 0;
    }
}


//definition of putchar for the printf lib, not used as there is no default module
void putchar_(char c){}



//get the character describing parity mode from a parity bit setting
char UART_getParityLetter(uint32_t bitValue){
    switch(bitValue){
        case UART_PARITY_NONE: return 'N';
        case UART_PARITY_EVEN: return 'E';
        case UART_PARITY_ODD: return 'O';
        case UART_PARITY_9BIT: return '9';
    }
    return 'I';
}